Table of Contents
 Interface IIdeaMember1D
Namespace
IdeaStatiCa.BimApi
Assembly
IdeaStatiCa.BimApi.dll
Represents named and identifiable generic member of that connects to up to two end nodes and might go through other nodes.
 Member is used to represent beam, column, truss, rib or beamslab
 Members consist from one or more elements, each defining cros-section and materials.
public interface IIdeaMember1D : IIdeaObjectConnectable, IIdeaPersistentObject, IIdeaObjectWithResults, IIdeaObject
Inherited Members
 IIdeaPersistentObject.Token
 IIdeaObjectWithResults.GetResults()
 IIdeaObject.Id
 IIdeaObject.Name
Properties
 Alignment
Alignment of the member's cross-section. Eccentricities are added up to the alignment.
Alignment Alignment { get; }
Property Value
Alignment
 CrossSection
Cross-section of the member.
IIdeaCrossSection CrossSection { get; }
Property Value
IIdeaCrossSection
 Elements
Elements this member consists of. Always returns a valid list with at least one element.
 The following guarantees are valid for the elements:
There is always at least one element in each member.
The first IdeaRS.OpenModel.Model.Element1D's IIdeaSegment3D's StartNode defines the start node of the member.
The N-th IdeaRS.OpenModel.Model.Element1D's IIdeaSegment3D EndNode is linked to the same node as (n+1)-th element's StartNode.
The Last IdeaRS.OpenModel.Model.Element1D's IIdeaSegment3D EndNode defines the end node of the member.
List<IIdeaElement1D> Elements { get; }
Property Value
List<IIdeaElement1D>
 MirrorY
Mirrors the cross-section of this member on the Y-axis.
bool MirrorY { get; }
Property Value
bool
 MirrorZ
Mirrors the cross-section of this member on the Z-axis.
bool MirrorZ { get; }
Property Value
bool
 Taper
Taper for specifying haunched member.
IIdeaTaper Taper { get; }
Property Value
IIdeaTaper
 Type
Type of member: beam, column, truss, rib or beamslab.
Member1DType Type { get; }
Property Value
Member1DType
 Edit this page